# 14. Grouping

In [2]:
import pandas as pd
df = pd.read_excel('score.xlsx', index_col='Sib. #')
df

          name school  height  English  Math  Science SWskills
Sib. #
1st      Sally  Biola     157       97    89       88      C++
2nd      David    UCI     173       78   100       98   Python
3rd     Daniel   Navy     175       95    78       94     Java
4th      Peter  Emery     130      100    97       97    Swift

In [4]:
df.groupby('school').get_group('UCI')

         name school  height  English  Math  Science SWskills
Sib. #
2nd     David    UCI     173       78   100       98   Python

In [7]:
# df.groupby('school').mean()

In [ ]:
# df.groupby('school').size() # count size

In [8]:
df.groupby('school')[['English', 'Math']].mean()

        English   Math
school
Biola      97.0   89.0
Emery     100.0   97.0
Navy       95.0   78.0
UCI        78.0  100.0

In [11]:
#df.groupby(['school', 'height']).mean()

In [13]:
df.groupby('school')['name'].count()

school
Biola    1
Emery    1
Navy     1
UCI      1
Name: name, dtype: int64